<?php

declare(strict_types=1);

namespace namwansoft\payment;

class Assets
{

    public function __construct() {}

    public static $idBank = [
        200 => 'PromptPay',
        1   => 'กสิกรไทย',
        2   => 'กรุงเทพ',
        3   => 'กรุงศรีอยุธยา',
        4   => 'ไทยพาณิชย์',
        5   => 'กรุงไทย',
        7   => 'ยูโอบี',
        9   => 'ทิสโก้',
        10  => 'ไอซีบีซี (ไทย)',
        11  => 'เกียรตินาคินภัทร',
        13  => 'สแตนดาร์ดชาร์เตอร์ด',
        14  => 'อาคารสงเคราะห์',
        15  => 'แลนด์ แอนด์ เฮาส์',
        16  => 'ออมสิน',
        17  => 'ธ.ก.ส.',
        18  => 'อิสลามแห่งประเทศไทย',
        19  => 'ซีไอเอ็มบี',
        20  => 'ทหารไทยธนชาต',
        23  => 'TrueWallet',
        25  => 'ซิตี้แบงค์',
        26  => 'ซูมิโตโม มิตซุย',
        27  => 'ไทยเครดิต',
        28  => 'มิซูโฮ',
        29  => 'ดอยซ์แบงก์',
        30  => 'ฮ่องกงและเซี่ยงไฮ้',
        31  => 'บีเอ็นพี พารีบาส์',
        32  => 'คลิกซ์',
        // 33  => '',
        // 34  => '',
        //
    ];

    public static $iconBank = [
        200 => 'pp',
        0   => "none",
        1   => "kbank",
        2   => "bbl",
        3   => "bay",
        4   => "scb",
        5   => "ktb",
        7   => "uob",
        9   => "tisco",
        10  => "icbc",
        11  => "kk",
        13  => "sc",
        14  => "ghb",
        15  => "lhb",
        16  => "gsb",
        17  => "baac",
        18  => "ibank",
        19  => "cimb",
        20  => "ttb",
        23  => "truewallet",
        25  => 'citi',
        26  => 'smbc',
        27  => 'tcrb',
        28  => 'mb',
        29  => 'db',
        30  => 'hsbc',
        31  => 'bnp',
        32  => 'clicx',
    ];

    public static $codeBank = [
        200 => 'PP',
        1   => '004',
        2   => '002',
        3   => '025',
        4   => '014',
        5   => '006',
        7   => '024',
        9   => '067',
        10  => '070',
        11  => '069',
        13  => '020',
        14  => '033',
        15  => '073',
        16  => '030',
        17  => '034',
        18  => '066',
        19  => '022',
        20  => '011',
        32  => '088',
    ];
}
